background/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "cellDisplacement.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          0;
        maxIter         200;
    }

    "alpha.water.*"
    {
        nAlphaCorr      3; // 2
        nAlphaSubCycles 1; // 1
        cAlpha          1;
        icAlpha         0;

        MULESCorr       yes;
        nLimiterIter    15;
        alphaApplyPrevCorr  yes;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
        minIter         1;
    }

    p_rgh
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0.0; // 0.05
    }

    p_rghFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0.0;
    }

    pcorr
    {
        $p;
        solver          PBiCGStab;
        preconditioner  DIC;
    }

    pcorrFinal
    {
        $pcorr;
    }

    yPsi
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7; // 1e-5
        relTol          0.0;
    }

    "(U|h)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7; // 1e-6
        relTol          0.0; // 0.1
    }

    "(UFinal|hFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.0;
    }

    "(k|omega|epsilon|kFinal|epsilonFinal|omegaFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7; // 1e-6
        relTol          0.0; // 0.01
    }

    "(rho|rhoFinal)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7; // 1e-6
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    correctPhi          yes; // no
    oversetAdjustPhi    yes; // no
    // ddtCorr             false;
    momentumPredictor   false;
}

relaxationFactors
{
    equations
    {
        ".*"        1;
    }
}

// added
cache
{
    grad(U);
}
// ************************************************************************* //
